; domain
(define (domain rover-dominio)
  (:requirements :strips :typing)
  
  (:types 
    lugar 
    muestra
  )
  
  (:predicates 
    (en ?l - lugar)
    (conectado ?l1 - lugar ?l2 - lugar)
    (muestra-en ?m - muestra ?l - lugar)
    (tiene ?m - muestra)
    (analizada ?m - muestra)
    (transmitida ?m - muestra)
    (zona-com ?l - lugar)
  )

  ;; Acción 1: Mover el rover de un lugar a otro conectado
  (:action mover
    :parameters (?desde - lugar ?hacia - lugar)
    :precondition (and 
      (en ?desde) 
      (conectado ?desde ?hacia)
    )
    :effect (and 
      (not (en ?desde)) 
      (en ?hacia)
    )
  )

  ;; Acción 2: Tomar una muestra que se encuentra en el lugar actual
  (:action tomar
    :parameters (?m - muestra ?l - lugar)
    :precondition (and 
      (en ?l) 
      (muestra-en ?m ?l)
    )
    :effect (and 
      (not (muestra-en ?m ?l)) 
      (tiene ?m)
    )
  )

  ;; Acción 3: Analizar una muestra que el rover tiene en su poder
  (:action analizar
    :parameters (?m - muestra)
    :precondition (and 
      (tiene ?m)
    )
    :effect (and 
      (analizada ?m)
    )
  )

  ;; Acción 4: Transmitir los datos de una muestra analizada desde una zona de comunicación
  (:action transmitir
    :parameters (?m - muestra ?l - lugar)
    :precondition (and 
      (en ?l) 
      (zona-com ?l) 
      (tiene ?m) 
      (analizada ?m)
    )
    :effect (and 
      (transmitida ?m)
    )
  )
)

; problem
(define (problem mision-rover-1)
  (:domain rover-dominio)
  
  (:objects 
    base r1 r2 ant - lugar
    m1 m2 - muestra
  )
  
  (:init 
    ;; Ubicación inicial del rover
    (en base)
    
    ;; Conexiones bidireccionales entre los lugares de la misión
    (conectado base r1)
    (conectado r1 base)
    
    (conectado r1 r2)
    (conectado r2 r1)
    
    (conectado r2 ant)
    (conectado ant r2)
    
    ;; Localización de las muestras científicas
    (muestra-en m1 r1)
    (muestra-en m2 r2)
    
    ;; Definición de la zona con antena de comunicación
    (zona-com ant)
  )
  
  (:goal 
    (and 
      (transmitida m1)
      (transmitida m2)
    )
  )
)

; plan
1. (mover base r1)
   deleted: (en base)
   added: (en r1)
   goals met: 0 of 2
2. (tomar m1 r1)
   deleted: (muestra-en m1 r1)
   added: (tiene m1)
   goals met: 0 of 2
3. (mover r1 r2)
   deleted: (en r1)
   added: (en r2)
   goals met: 0 of 2
4. (tomar m2 r2)
   deleted: (muestra-en m2 r2)
   added: (tiene m2)
   goals met: 0 of 2
5. (mover r2 ant)
   deleted: (en r2)
   added: (en ant)
   goals met: 0 of 2
6. (analizar m2)
   added: (analizada m2)
   goals met: 0 of 2
7. (analizar m1)
   added: (analizada m1)
   goals met: 0 of 2
8. (transmitir m2 ant)
   added: (transmitida m2)
   goals met: 1 of 2
9. (transmitir m1 ant)
   added: (transmitida m1)
   goals met: 2 of 2
